{
  "backend/default_fingering_config.mo": "Defines the default Alto C Ocarina fingering configuration as a Motoko module, mapping notes (C, D, E, F) to boolean hole arrays.",
  "backend/main.mo": "Main Motoko actor implementing the backend API for managing ocarina fingering configurations (get/set/reset) and compositions (save/get/list), with admin-only access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (preset song library, song library UI, guided playback mode) to their corresponding source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key behaviors for build planning reference.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom property design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Ocarina Composer React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component composing the full-page layout with Header, MusicEditor, and Footer in a flex column structure.",
  "frontend/src/components/FingeringConfigEditor.tsx": "UI component rendering a scrollable table for editing the 13-note relative fingering configuration, with per-hole checkboxes and a reset button.",
  "frontend/src/components/Footer.tsx": "Footer component displaying a caffeine.ai attribution link and copyright notice with a heart icon.",
  "frontend/src/components/GuidedPlaybackView.tsx": "Renders a step-by-step guided playback UI for a preset song, showing the current note, fingering illustration, progress bar, and playback controls (play/pause/stop/skip).",
  "frontend/src/components/Header.tsx": "Simple page header component displaying the app title 'Ocarina Composer' and subtitle with a music icon.",
  "frontend/src/components/LoadCompositionDialog.tsx": "Dialog for loading a saved composition either by selecting from a list or entering an ID directly, using React Query hooks to fetch compositions from the backend.",
  "frontend/src/components/LyricsEditor.tsx": "Renders a horizontal row of text inputs for editing per-note lyrics, labeled with the corresponding note name and octave.",
  "frontend/src/components/MusicEditor.tsx": "Main composition editor component that orchestrates note entry, playback, settings dialogs, authentication, and switches to GuidedPlaybackView when a preset song is selected.",
  "frontend/src/components/NoteDurationSelector.tsx": "Renders a row of buttons for selecting a note duration (whole through sixteenth), highlighting the currently selected duration.",
  "frontend/src/components/NoteSequenceGuide.tsx": "Displays a scrollable list of all notes in a sequence with mini hole diagrams, highlighting the current step and auto-scrolling it into view.",
  "frontend/src/components/OcarinaIllustration.tsx": "SVG-based visual of a 4-hole ocarina that fills or empties holes based on the fingering pattern computed for the currently selected note.",
  "frontend/src/components/OcarinaSettingsDialog.tsx": "A settings dialog component for authenticated users to configure ocarina octave range and fingering patterns, with save/reset functionality backed by API mutations.",
  "frontend/src/components/OcarinaTablature.tsx": "Renders a visual ocarina tablature for a list of notes, displaying a 4-hole grid with filled/unfilled holes based on the fingering configuration and highlighting the currently playing note.",
  "frontend/src/components/PianoKeyboard.tsx": "Renders an interactive piano keyboard spanning C3–C7, visually highlighting keys within the active ocarina range and invoking a callback when a key is clicked.",
  "frontend/src/components/PlaybackControls.tsx": "A toolbar component providing play, stop, pause/resume, repeat toggle, save, and load buttons for controlling composition playback.",
  "frontend/src/components/SaveCompositionDialog.tsx": "A dialog for saving an ocarina composition with a title and description, displaying the returned composition ID with a copy button on success.",
  "frontend/src/components/SheetMusic.tsx": "Renders a simplified sheet music view of notes on a staff with SVG note heads and stems, supporting note selection, deletion, duration changes, and lyrics editing.",
  "frontend/src/components/SongLibraryDialog.tsx": "A dialog component that displays a categorized, collapsible list of preset songs and allows the user to select one, triggering an `onSelectSong` callback and closing the dialog.",
  "frontend/src/data/presetSongs.ts": "Defines preset song data (notes, tempo, category) for songs like Twinkle Twinkle, Happy Birthday, Zelda's Lullaby, and Mario Underground, organized by category with helper exports.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "A React hook that manages full-song audio playback using the Web Audio API, supporting play, pause, resume, stop, and repeat functionality with per-note scheduling based on tempo.",
  "frontend/src/hooks/useComposition.ts": "A React hook that manages the full state of a music composition including notes, tempo, octave range, and fingering configuration, with support for seeding fingering defaults from the backend when authenticated.",
  "frontend/src/hooks/useGuidedPlayback.ts": "A React hook that provides step-by-step guided playback for a preset song, playing one note at a time via the Web Audio API with controls for play, pause, stop, and manual step navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on compositions and fingering defaults, interfacing with the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/music.ts": "Defines TypeScript types and interfaces for musical concepts including notes, compositions, ocarina fingering patterns, and preset songs.",
  "frontend/src/utils/audioSynthesis.ts": "Provides a `createOcarinaSound` function that uses the Web Audio API to synthesize an ocarina-like tone with ADSR envelope and dual oscillators.",
  "frontend/src/utils/compositionSerializer.ts": "Provides functions to serialize a Composition object to a UTF-8 encoded Uint8Array and deserialize it back using JSON.",
  "frontend/src/utils/defaultFingeringPatterns.ts": "Defines default 4-hole ocarina fingering patterns for all 13 chromatic notes in an octave span and exports predefined octave range options.",
  "frontend/src/utils/ocarinaNoteMapper.ts": "Provides utilities to map notes to fingering patterns from a shared configuration, calculate note frequencies via equal temperament, and check if a note falls within an ocarina's octave range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch CSS variables), border radii, fonts, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing the ocarina app's current version, feature list, architectural notes, and known issues, including 15 preset songs with guided step-by-step note highlighting across three categories."
}