{
  "backend/main.mo": "Motoko actor implementing a simple composition storage service with functions to save, retrieve, and list compositions (title, description, midiData) using a Map data structure.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: vertical wrapping for SheetMusic component and reorganization of MusicEditor component layout order.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend TypeScript/React files describing the 4-hole ocarina composer application's components, hooks, utilities, and type definitions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the Ocarina Composer application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering Header, MusicEditor, and Footer in a flex column layout with Tailwind styling.",
  "frontend/src/components/FingeringConfigEditor.tsx": "Component providing a scrollable table interface to configure 4-hole fingering patterns for all notes in the selected octave range with checkboxes and reset functionality.",
  "frontend/src/components/Footer.tsx": "Footer component displaying attribution link to caffeine.ai with UTM parameters and copyright notice.",
  "frontend/src/components/Header.tsx": "Header component displaying the Ocarina Composer title, subtitle, and music icon.",
  "frontend/src/components/LoadCompositionDialog.tsx": "Dialog component that fetches and displays a list of saved compositions, allowing users to select and load a composition into the editor.",
  "frontend/src/components/LyricsEditor.tsx": "Component rendering input fields for each note to add/edit lyrics, displayed horizontally with note names above each input.",
  "frontend/src/components/MusicEditor.tsx": "Main editor component orchestrating all composition features with vertical layout: OcarinaIllustration, PianoKeyboard, controls, OcarinaTablature, SheetMusic, and LyricsEditor, plus inline title/description editing and save/load/clear actions.",
  "frontend/src/components/NoteDurationSelector.tsx": "A component that renders buttons for selecting note durations (whole, half, quarter, eighth, sixteenth) with musical symbols and labels.",
  "frontend/src/components/OcarinaIllustration.tsx": "Displays an SVG illustration of a 4-hole ocarina with holes arranged in a square formation, showing which holes should be closed/open for a given note based on fingering configuration.",
  "frontend/src/components/OcarinaSettingsDialog.tsx": "A dialog component with tabs for configuring ocarina settings including octave range selection and fingering pattern customization.",
  "frontend/src/components/OcarinaTablature.tsx": "Renders a visual tablature showing fingering patterns for a sequence of notes, with holes displayed in a 2x2 grid and highlighting for the currently playing note.",
  "frontend/src/components/PianoKeyboard.tsx": "An interactive piano keyboard component that renders white and black keys across a configurable octave range and triggers callbacks when keys are clicked.",
  "frontend/src/components/PlaybackControls.tsx": "Simple playback control buttons (Play/Stop) for controlling music playback with loading states and disabled states.",
  "frontend/src/components/SaveCompositionDialog.tsx": "A dialog for saving compositions with title and description inputs, validation, and integration with the save composition mutation hook.",
  "frontend/src/components/SheetMusic.tsx": "Displays musical notation on a staff with treble clef, time signature, and interactive notes that can be selected, deleted, and edited with lyrics and duration changes.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "React hook that handles audio playback of musical notes using Web Audio API, scheduling ocarina sounds with proper timing based on tempo and providing play/stop controls with visual feedback callbacks.",
  "frontend/src/hooks/useComposition.ts": "React hook that manages composition state including notes, metadata, octave range, and fingering configurations, providing methods to add/delete/modify notes and manage fingering patterns for a 4-hole ocarina.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations: listing compositions, fetching individual compositions with deserialization, and saving compositions with serialization and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components with earth-toned palette.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/types/music.ts": "TypeScript type definitions for musical concepts including notes, durations, compositions, time signatures, and 4-hole ocarina fingering patterns with octave range configuration.",
  "frontend/src/utils/audioSynthesis.ts": "Web Audio API function that creates ocarina-like sounds using dual detuned sine oscillators with lowpass filtering and ADSR envelope shaping.",
  "frontend/src/utils/compositionSerializer.ts": "Utility functions for serializing compositions to Uint8Array and deserializing back to Composition objects using JSON encoding.",
  "frontend/src/utils/defaultFingeringPatterns.ts": "Generates default fingering patterns for 4-hole ocarina across chromatic scales and octave ranges, with progressive hole-opening sequences from right to left and predefined octave range configurations.",
  "frontend/src/utils/ocarinaNoteMapper.ts": "Maps notes to fingering patterns using user-configured mappings and calculates note frequencies using equal temperament formula with A4=440Hz as reference.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/fonts, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata describing a 4-hole ocarina tablature app with traditional circle notation, piano keyboard input, sheet music layout, lyrics support, synthetic audio playback, configurable fingering/octave mappings, and song saving capabilities."
}