{
  "backend/default_fingering_config.mo": "Defines the default Alto C Ocarina fingering configuration as a Motoko module, mapping note names to boolean hole arrays for C4–F4.",
  "backend/main.mo": "Main Motoko actor exposing query and update functions for managing ocarina fingering defaults and saving/retrieving/listing MIDI compositions in stable storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, test IDs, and confidence levels for multi-octave keyboard, octave range settings, fingering pattern generation, and note mapper updates.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's React components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Ocarina Composer SPA, mounting the React app at the `#root` div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that composes the full-page layout with Header, MusicEditor, and Footer in a flex column.",
  "frontend/src/components/FingeringConfigEditor.tsx": "Table-based editor component for viewing and toggling the 4-hole fingering pattern for each of the 13 chromatic notes in the active ocarina octave range, with a reset button.",
  "frontend/src/components/Footer.tsx": "Footer component displaying a caffeine.ai attribution link with UTM parameters and a dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Application header showing the Ocarina Composer title, music icon, and a subtitle describing the instrument type.",
  "frontend/src/components/LoadCompositionDialog.tsx": "Dialog allowing users to load a saved composition either by selecting from a scrollable list or by entering a numeric ID directly, with error handling and toast feedback.",
  "frontend/src/components/LyricsEditor.tsx": "Renders a horizontal row of text inputs for editing per-note lyrics, displaying the note name/octave above each input field.",
  "frontend/src/components/MusicEditor.tsx": "Main composition editor component that integrates the piano keyboard, sheet music, ocarina illustration, tablature, lyrics editor, playback controls, and save/load dialogs into a single UI.",
  "frontend/src/components/NoteDurationSelector.tsx": "Renders a row of buttons for selecting note duration (whole, half, quarter, eighth, sixteenth), highlighting the currently selected duration.",
  "frontend/src/components/OcarinaIllustration.tsx": "Displays an SVG illustration of a 4-hole ocarina with holes visually toggled open or closed based on the fingering pattern for the currently selected note.",
  "frontend/src/components/OcarinaSettingsDialog.tsx": "A settings dialog with tabs for configuring the ocarina's octave range and fingering patterns, including options to save or reset global fingering defaults via API calls.",
  "frontend/src/components/OcarinaTablature.tsx": "Renders a grid-based tablature view showing the 4-hole fingering diagram for each note in the composition, highlighting the currently playing note.",
  "frontend/src/components/PianoKeyboard.tsx": "Renders a full piano keyboard spanning C3–C7 with white and black keys, visually highlighting the active ocarina range and allowing note input via click.",
  "frontend/src/components/PlaybackControls.tsx": "Simple playback control component that renders a Play or Stop button depending on the current playback state.",
  "frontend/src/components/SaveCompositionDialog.tsx": "A dialog component for saving an ocarina composition with title/description inputs. On success, displays the returned composition ID with a copy-to-clipboard button.",
  "frontend/src/components/SheetMusic.tsx": "Renders a visual sheet music view of notes using SVG staff lines and note heads, supporting selection, playback highlighting, duration changes, and lyrics editing.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an anonymous or authenticated identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "A hook that manages Web Audio API playback of a note sequence, scheduling ocarina sounds and visual note-highlight callbacks based on tempo, with play/stop controls.",
  "frontend/src/hooks/useComposition.ts": "A hook that manages the full composition state including notes, time signature, tempo, octave range, and fingering configuration, seeding fingering defaults from the backend on first load.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on compositions and fingering defaults via the backend actor, plus helper functions to convert between backend and frontend fingering config types.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/types/music.ts": "Defines core TypeScript types for the music domain: Note, Composition, TimeSignature, FingeringPattern, FingeringConfiguration, and OctaveRange.",
  "frontend/src/utils/audioSynthesis.ts": "Implements `createOcarinaSound` which builds a Web Audio API graph with two detuned sine oscillators, a lowpass filter, and an ADSR envelope to synthesize an ocarina-like tone.",
  "frontend/src/utils/compositionSerializer.ts": "Provides `serializeComposition` and `deserializeComposition` functions that convert a Composition object to/from a UTF-8 encoded JSON Uint8Array.",
  "frontend/src/utils/defaultFingeringPatterns.ts": "Defines the default 4-hole ocarina fingering sequence and exports `getDefaultFingeringPatterns` to generate a 13-note FingeringConfiguration for a given base octave, plus predefined OCTAVE_RANGES constants.",
  "frontend/src/utils/ocarinaNoteMapper.ts": "Utility functions for mapping notes to fingering patterns, computing equal-temperament frequencies, and checking whether a note falls within a given ocarina octave range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends theme with custom radius, shadows, fonts, and accordion animations, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 27) describing the app's features, architectural decisions, and known issues for a 4-hole ocarina tablature music writing app."
}