{
  "kind": "build_request",
  "title": "Add 15 Preset Songs with Guided Note Sequence Playback",
  "projectName": "Ocarina Composer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Define a library of 15 preset songs as structured note sequence data, organized into three categories: Classic Folk (Twinkle Twinkle Little Star, Happy Birthday, Mary Had a Little Lamb), Video Games (Zelda's Lullaby, Mario Underground Theme, Tetris Theme/Korobeiniki, Final Fantasy Prelude, Sweden from Minecraft, Megalovania from Undertale), and Mixed Genres (Smoke on the Water, Blue Da Ba Dee, Rivers of Babylon, Gasolina, Wonderwall, Around the World). Each song entry must include a title, category, tempo (BPM), and an ordered array of notes mapped to the existing Note type used in the composition system.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-user-3"
        ],
        "quotes": [
          "The songs play as guided note sequences (showing which holes to cover step-by-step). Some of the video game songs like Legend of Zelda, Mario, Tetris, Final Fantasy, Minecraft, Undertale?"
        ]
      },
      "acceptanceCriteria": [
        "All 15 songs are defined as note sequence data accessible in the frontend",
        "Each song has a title, category (Classic Folk / Video Games / Mixed Genres), tempo, and array of notes",
        "Notes use the same Note type as the existing composition system",
        "Songs are grouped correctly into the three genre categories"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Song Library UI panel or modal accessible from the main app layout that lists all 15 preset songs grouped by category (Classic Folk, Video Games, Mixed Genres). Users can browse and select a song to load it into a guided playback mode. Each song entry should show its title and category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-user-3"
        ],
        "quotes": [
          "The songs play as guided note sequences (showing which holes to cover step-by-step)"
        ]
      },
      "acceptanceCriteria": [
        "A Song Library button or entry point is visible in the main app UI",
        "Opening the library shows all 15 songs grouped by category",
        "Each song shows its title",
        "Selecting a song loads it into guided playback mode",
        "The UI clearly distinguishes the three categories"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a Guided Song Playback mode that, when a preset song is selected, displays the song's notes step-by-step. For each step: highlight the current note's fingering on the OcarinaIllustration (showing which holes to cover/uncover), show the note name, and advance through the sequence. Include playback controls (Play, Pause, Stop, Previous Step, Next Step) and display the current step number out of total steps (e.g., 'Step 3 of 24'). The mode should auto-advance through notes at the song's tempo when playing, or allow manual step-through when paused.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-user-3"
        ],
        "quotes": [
          "The songs play as guided note sequences (showing which holes to cover step-by-step)"
        ]
      },
      "acceptanceCriteria": [
        "The OcarinaIllustration updates to show the correct fingering (hole coverage) for each step",
        "The current step is clearly highlighted/indicated",
        "Step counter shows current position out of total notes (e.g., 'Step 3 of 24')",
        "Play button auto-advances notes at the song's BPM tempo",
        "Pause stops auto-advance and holds on the current step",
        "Stop resets to the first step",
        "Previous and Next buttons allow manual step-through",
        "The note name for the current step is displayed",
        "Audio plays the note at each step using the existing audio synthesis system"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a visual step-by-step note guide alongside the ocarina illustration during guided playback, showing a scrollable or paginated list of upcoming notes with their fingering hole indicators. The current note should be prominently highlighted, and completed notes should be visually dimmed or marked. This gives the user an at-a-glance view of what notes are coming next in the sequence.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-user-3"
        ],
        "quotes": [
          "showing which holes to cover step-by-step"
        ]
      },
      "acceptanceCriteria": [
        "A sequence guide is shown during guided playback listing upcoming notes",
        "The currently active note is highlighted prominently",
        "Completed notes are visually distinguished (dimmed or marked)",
        "The view scrolls or pages to keep the current note visible",
        "Each note entry shows the note name and a small hole diagram or indicator"
      ]
    }
  ],
  "constraints": [
    "All note data must use the existing Note and FingeringPattern types defined in frontend/src/types/music.ts",
    "The OcarinaIllustration component must be reused for hole highlighting — do not duplicate its SVG logic",
    "The existing audio synthesis (audioSynthesis.ts) and playback hooks must be reused for note audio",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, useActor.ts, main.tsx, or frontend/src/components/ui"
  ],
  "nonGoals": [
    "Saving preset songs as user compositions to the backend",
    "Allowing users to edit or modify the preset song note sequences",
    "Adding new backend endpoints for song storage",
    "Sheet music notation rendering for preset songs",
    "User-created song libraries or custom song uploads"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}