{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 15 Preset Songs with Guided Note Sequence Playback",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Define a library of 15 preset songs as structured note sequence data with title, category, tempo, and note arrays",
      "acceptanceCriteria": [
        "All 15 songs are defined as note sequence data accessible in the frontend",
        "Each song has a title, category (Classic Folk / Video Games / Mixed Genres), tempo, and array of notes",
        "Notes use the same Note type as the existing composition system",
        "Songs are grouped correctly into the three genre categories"
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/presetSongs.ts",
          "operation": "create",
          "description": "Create a new data file defining all 15 preset songs grouped into three categories (Classic Folk, Video Games, Mixed Genres). Each song entry includes a unique ID, title, category string, tempo in BPM, and an ordered array of Note objects matching the Note type from frontend/src/types/music.ts. Songs include: Classic Folk (Twinkle Twinkle Little Star, Happy Birthday, Mary Had a Little Lamb), Video Games (Zelda's Lullaby, Mario Underground Theme, Tetris Theme/Korobeiniki, Final Fantasy Prelude, Sweden from Minecraft, Megalovania from Undertale), and Mixed Genres (Smoke on the Water, Blue Da Ba Dee, Rivers of Babylon, Gasolina, Wonderwall, Around the World). Export both individual song constants and a categorized songs object."
        },
        {
          "path": "frontend/src/types/music.ts",
          "operation": "modify",
          "description": "Add TypeScript type definitions for PresetSong (containing id, title, category, tempo, and notes array) and SongCategory enum or union type covering the three categories. These types will be used by the preset songs data file and guided playback components."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Song Library UI panel accessible from the main app that lists all 15 preset songs grouped by category for selection",
      "acceptanceCriteria": [
        "A Song Library button or entry point is visible in the main app UI",
        "Opening the library shows all 15 songs grouped by category",
        "Each song shows its title",
        "Selecting a song loads it into guided playback mode",
        "The UI clearly distinguishes the three categories"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SongLibraryDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component that displays all preset songs from frontend/src/data/presetSongs.ts organized by category (Classic Folk, Video Games, Mixed Genres). Each category section shows its songs as clickable list items displaying the song title. When a song is selected, invoke a callback to load it into guided playback mode. Use shadcn/ui Dialog, ScrollArea, and Button components for the UI structure."
        },
        {
          "path": "frontend/src/components/MusicEditor.tsx",
          "operation": "modify",
          "description": "Add a button to open the Song Library dialog in the main editor toolbar area. Wire the SongLibraryDialog component into this layout, passing a callback that receives the selected PresetSong and transitions the UI into guided playback mode by setting appropriate state (selected song, playback mode flag). Position the button near other action controls like Save/Load."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement a Guided Song Playback mode that displays notes step-by-step with highlighted fingering, playback controls, and step counter",
      "acceptanceCriteria": [
        "The OcarinaIllustration updates to show the correct fingering (hole coverage) for each step",
        "The current step is clearly highlighted/indicated",
        "Step counter shows current position out of total notes (e.g., 'Step 3 of 24')",
        "Play button auto-advances notes at the song's BPM tempo",
        "Pause stops auto-advance and holds on the current step",
        "Stop resets to the first step",
        "Previous and Next buttons allow manual step-through",
        "The note name for the current step is displayed",
        "Audio plays the note at each step using the existing audio synthesis system"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGuidedPlayback.ts",
          "operation": "create",
          "description": "Create a custom hook that manages guided playback state for a PresetSong including current step index, play/pause/stop state, and auto-advance timing based on the song's tempo (BPM). Provide functions for play, pause, stop, nextStep, and previousStep. Use setInterval or requestAnimationFrame to auto-advance steps at the tempo rate when playing. Integrate with the existing audio synthesis from frontend/src/utils/audioSynthesis.ts to play each note as it becomes active. Return the current note, step index, total steps, playback state, and control functions."
        },
        {
          "path": "frontend/src/components/GuidedPlaybackView.tsx",
          "operation": "create",
          "description": "Create a component that renders the guided playback UI for a selected PresetSong. Display the song title, current step counter (e.g., 'Step 3 of 24'), and the current note name prominently. Reuse the OcarinaIllustration component to show the fingering pattern for the current note by passing the appropriate FingeringPattern prop. Include playback control buttons (Play, Pause, Stop, Previous Step, Next Step) that invoke the control functions from useGuidedPlayback hook. Use shadcn/ui Button components for controls and Card for layout structure."
        },
        {
          "path": "frontend/src/components/MusicEditor.tsx",
          "operation": "modify",
          "description": "Add conditional rendering logic to switch between the normal composition editor view and the GuidedPlaybackView when a preset song is loaded for guided playback. Track guided playback mode state (active song, playback mode flag) and render GuidedPlaybackView with the selected song when in guided mode. Provide a way to exit guided playback mode and return to the normal editor."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a visual step-by-step note guide showing upcoming notes with the current note highlighted and completed notes dimmed",
      "acceptanceCriteria": [
        "A sequence guide is shown during guided playback listing upcoming notes",
        "The currently active note is highlighted prominently",
        "Completed notes are visually distinguished (dimmed or marked)",
        "The view scrolls or pages to keep the current note visible",
        "Each note entry shows the note name and a small hole diagram or indicator"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NoteSequenceGuide.tsx",
          "operation": "create",
          "description": "Create a component that displays a scrollable list of all notes in the current preset song sequence. Each list item shows the note name and a compact visual indicator of the fingering pattern (simplified hole diagram or badges for closed holes). Apply distinct styling to mark completed notes (dimmed/grayed), the current active note (highlighted with accent color/border), and upcoming notes (normal). Use a ref and scrollIntoView to auto-scroll the active note into the visible area. Accept the note array, current step index, and fingering configuration as props."
        },
        {
          "path": "frontend/src/components/GuidedPlaybackView.tsx",
          "operation": "modify",
          "description": "Integrate the NoteSequenceGuide component into the guided playback layout, positioning it alongside or below the OcarinaIllustration. Pass the preset song's note sequence, current step index from useGuidedPlayback, and the fingering configuration from the composition state. Ensure the guide updates reactively as playback advances through steps."
        }
      ]
    }
  ]
}